export const gamesSites = [
  {
    siteName: 'Destiny.Games - Разработка и локализация MMORPG (ddestiny.ru)',
    siteLink: 'https://www.ddestiny.ru/?roistat_visit=8309392',
    siteDescription: 'Отзывчивый интерфейс, стандартный дизайн. Мне нравится блок новостей в виде не напрягающего легкого списка'
  },
  {
    siteName: 'Game Garden (game-garden.com)',
    siteLink: 'https://game-garden.com/ru/about/',
    siteDescription: 'Яркий и привлекающий сайт, похожий дизайном на игру. Вёрстка сделана, в основном, линками'
  },
  {
    siteName: 'Apps Ministry. Разработка и издательство мобильных приложений',
    siteLink: 'http://appsministry.com/?roistat_visit=8309392',
    siteDescription: 'Приятный и комортный глазу дизайн. Всё просто и понятно. Вёрстка частично по BEM, но вложенность секций в дивы и секции зашкаливает )). Нет сертификата https'
  },
  {
    siteName: 'Новая игра про динозавров в мире будущего! (101xp.com)',
    siteLink: 'https://corp.101xp.com/news/novaya-igra-pro-dinozavrov-v-mire-budushchego',
    siteDescription: 'Современный сайт, довольно красивый. Верстка по BEM. Нравится, что есть классный интерактивный слайдер внизу'
  },
  {
    siteName: '01-SACRALITH — Odd Meter (odd-meter.com)',
    siteLink: 'http://odd-meter.com/portfolio-item/scralith/',
    siteDescription: 'Локаничный дизайн современного сайта, но вёрстка кажется мне сложной и симантически не верной. Нравится интерактивность и логотип. Нет сертификата https'
  },
  {
    siteName: 'MMORPG CARNAGE: бесплатная онлайн игра. Лучшая браузерная игра. Играть в многопользовательскую ролевую игру прямо сейчас!',
    siteLink: 'http://www.carnage.ru/',
    siteDescription: 'Сайт игры в которую я играл в свое время. Не адаптивный и устаревший дизайн, но классный логотип. Нет сертификата https'
  }
]

export const gameNews = [
  {
    siteName: 'Techland выпустила хотфикс для обновления Dying Light 2 1.9.0 (playground.ru)',
    siteLink: 'https://www.playground.ru/dying_light_2/news/techland_vypustila_hotfiks_dlya_obnovleniya_dying_light_2_1_9_0-1603904',
    siteDescription: 'Новость отличная и решает задачу донесения информации о фиксах в игре. Это, скорее всего, привлечет новых пользователей или мотивирует, всё таки, попробовать в неё поиграть тех, кто знаком с игрой, но не скачал её',
    siteOpinion: 'Кратко и по делу, локанично. Есть чёткий список фиксов. Возможно, стоило бы добавить источник, где можно подробнее почитать и скачть обновление'
  },
  {
    siteName: 'Ubisoft покидает творческий директор Assassins Creed 4: Black Flag и Origins — Игромания (igromania.ru)',
    siteLink: 'https://www.igromania.ru/news/123262/Ubisoft_pokidaet_tvorcheskiy_direktor_Assassins_Creed_4_Black_Flag_i_Origins.html',
    siteDescription: 'Новость нейтральная, но интересная. Решает задачу простого ознакомления юзера с судьбой игровой компании, но, дополнительно, намекает, что всё не так хорошо в компании, к тому же релиз опять перенесли',
    siteOpinion: 'Опять таки, кратко - то, что нужно для таких новостей. Я бы добавил фотку Жана Гесдона'
  },
  {
    siteName: 'Геймплей Pacific Drive — автомобильного выживача в зоне отчуждения | StopGame',
    siteLink: 'https://stopgame.ru/newsdata/56967/geympley_pacific_drive_avtomobilnogo_vyzhivacha_v_zone_otchuzhdeniya',
    siteDescription: 'Новость интересная, решает задачу ознакомления юзера с геймплеем игры',
    siteOpinion: 'Хорошо подана, т.к. есть описание, карусель картинок (это очень удобно) и frame с видео на ютуб. Ничего лишнего'
  },
  {
    siteName: 'Need For Speed Most Wanted 2012. Заложник названия — Игры на DTF',
    siteLink: 'https://stopgame.ru/newsdata/56967/geympley_pacific_drive_avtomobilnogo_vyzhivacha_v_zone_otchuzhdeniya',
    siteDescription: 'Ностальгическая новость (для олдов, таких как я)). Решает задачу ознакомления с историей игры.',
    siteOpinion: 'Хорошо подана, т.к. есть описание, карусель картинок (это очень удобно) и frame с видео на ютуб. Ничего лишнего'
  },
  {
    siteName: 'Институт развития интернета выдаст авторам «Смуты» ещё четверть миллиарда рублей и уже думает, как поддерживать игру после успеха на релизе - (comnews24.ru)',
    siteLink: 'https://comnews24.ru/igry/institut-razvitiya-interneta-vydast-avtoram-smuty-eshhjo-chetvert-milliarda-rublej-i-uzhe-dumaet-kak-podderzhivat-igru-posle-uspeha-na-relize/',
    siteDescription: 'Нейтральная новость. Решает задачу привлечения внимания к игре за счёт раскрытия бюджета',
    siteOpinion: 'Нравится, что раскрыта информация о деньгах и я могу примерно представить масштаб игры. Есть картинки и подробности о релизе'
  },
]
export const compareIssues = [
  {
    issueDescription: 'Главное отличие - раскрывающийся контент у блоков обновлений. Это удобнее, на мой взгляд, т.к. проще ориентироваться по загаловкам. Считаю это улучшением юзабилити',
    issueEvaluation: 'good'
  },
  {
    issueDescription: 'Добавлен блок с рекомендациями к прочтению - улучшение, т.к. пользователь может увидеть что-то интересное и прочитать сразу',
    issueEvaluation: 'good'
  },
  {
    issueDescription: 'Добавлена ссылка на форум - улучшение, т.к. по одному щелчку пользователь пошёл общаться и, тем самым, поддерживать комьюнити',
    issueEvaluation: 'good'
  },
  {
    issueDescription: 'Слайдер, на мой взгляд, можно сделать более интерактивным - добавить возможность прокрутки захватив картинку',
    issueEvaluation: 'bad'
  },
  {
    issueDescription: 'Кнопку "свернуть" должна быть внизу блока. После "разворачивания" контента кнопка могла бы перемещаться вниз. Добавить сворачивание по Esc',
    issueEvaluation: 'bad'
  },
  {
    issueDescription: 'Удачно сделаны вставки о будущих обновлениях в конкертных темах. Возможно, было бы удачно добавить блок с планируемыми обновлениями в будущих версиях',
    issueEvaluation: 'good'
  },
  {
    issueDescription: 'Подавл сайта слишком массивный и перегружен текстом',
    issueEvaluation: 'bad'
  },
  {
    issueDescription: 'Баг - боковые кнопки появляются в самом низу после того, как пропадают',
    issueEvaluation: 'img'
  },
  {
    issueDescription: 'Для "Рекомендумое к прочтению" на разрешении Tablet должно быть 4 блока, а не 3',
    issueEvaluation: 'bad'
  }
]

export const aboutGameFix = [
  {
    elementName: 'burgerMenu',
    elementProblem: 'Слишком широкое и не плавное',
    elementFix: 'Улучшение плавности позволит создать лучшее визуальное впечатление о сайте. Компактное меню упростит навигацию пользователя'
  },
  {
    elementName: 'burgerMenu',
    elementProblem: 'Крестик закрытия слева',
    elementFix: 'Закрытие бургер-меню удобнее делать слева, т.к. список навигации тоже находится слева. Улучшение юзабилити'
  },
  {
    elementName: 'burgerMenu',
    elementProblem: 'Нет закрытия по Esc',
    elementFix: 'Закрытие бургер-меню по Esc создаёт дополнительное удобство пользования сайтом'
  },
  {
    elementName: 'burgerMenu',
    elementProblem: 'Нет закрытия по Overlay',
    elementFix: 'Закрытие бургер-меню по Overlay создаёт дополнительное удобство пользования сайтом'
  },
  {
    elementName: 'burgerMenuAccount',
    elementProblem: 'Список навигации слева',
    elementFix: 'Удобнее для пользователя иметь список навигации справа, т.к. при использовании телефона не придётся тянуться в левую часть экрана'
  },
  {
    elementName: 'burgerMenuAccount',
    elementProblem: 'Нет закрытия по Overlay',
    elementFix: 'Закрытие бургер-меню по Overlay создаёт дополнительное удобство пользования сайтом'
  },
  {
    elementName: 'main',
    elementProblem: 'Для Tablet и Mobile разрешении пропадает главная картинка',
    elementFix: 'Добавить картинку, как на Desktop-разрешении. Без фоновой картинки этот раздел сайта кажется не наполненным'
  },
  {
    elementName: 'main',
    elementProblem: 'Фоновая картинка создаёт высокий контраст',
    elementFix: 'Уменьшение яркости/контраста фона за счёт overlay сделает сайт приятнее для глаз пользователя'
  },
  {
    elementName: 'main',
    elementProblem: 'Текст "Войти или создать аккаунт" кажется не современным',
    elementFix: 'Весь верхний хедер маленький и союз "или" лишний. Увеличения текста в хедере улучшит читаемость сайта. Вместо "или" сделать отступ между блоками. Т.о. сайт не будет напоминать первые сайты с мелким шрифтом'
  },
  {
    elementName: 'main',
    elementProblem: 'Блок из 3х видео не интерактивный. Воспроизведине только из модалки после ещё одного нажатия',
    elementFix: 'Видео должно включаться при наведении либо про клике. Открытие на полный экран должно быть по кнопке. Тем самым сайт будет более прогрессивным'
  },
  {
    elementName: 'main',
    elementProblem: 'Кнопки "Скачать игру/Системные требования" конрастные и навящивые',
    elementFix: 'Скачать игру/Системные требования/Играй бесплатно в один блок и убрать с "лица". "Ситсемные требования" я бы убрал в раздел "Скачать", т.к. это дополнительная информация'
  },
  {
    elementName: 'main',
    elementProblem: 'Секция "Классы кораблей" классная, но не интеракивная',
    elementFix: 'Добавить анимацию на харакетристики. Добавить всплывающие подсказки с техническими данными о корабле, не только описание'
  },
  {
    elementName: 'main',
    elementProblem: 'Секция "Смена погоды в бою" показывает рыцарский замок - нарушает логическую связь',
    elementFix: 'Сменить видео на фрагмент морского боя, либо плывущего корабля'
  },
  {
    elementName: 'main',
    elementProblem: 'Слайдер "Галлерея сражения" не удобно прокручивать',
    elementFix: 'Сделать крупный всплывающий скролл-бар. Добавить возможность прокрутки за картинку'
  },
  {
    elementName: 'main',
    elementProblem: 'Раздел "Премиум магазин" не адаптирован под Mobile и Tablet разрешение',
    elementFix: 'Сделать адаптивную вёрстку контента и Burger menu. Реализовать закрытие по overlay'
  },
  {
    elementName: 'main',
    elementProblem: 'Подключение шрифтов и скриптов выполнено хаотично',
    elementFix: 'Настроить Webpack'
  },
  {
    elementName: 'main',
    elementProblem: 'Всплывающее меню верхнего хедера разделов "Игры" и "Сервисы" заставляет пользователя много кликать',
    elementFix: 'Добавить изменение контента с задержкой при наведении на элементы меню "Премиум магазин"-"Клановй портал"-"Lesta Game Center"-и т.д'
  },
  {
    elementName: 'main',
    elementProblem: 'В разделе "Адмиралтейство" не работает кнопка "Домой"',
    elementFix: 'Реализовать функционал кнопки. Нижняя навигация не заметна, перенести в хедер. Подумать над улучшенеим удобства навигации'
  },
]

